---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewBackClipping
source: html/f323d97b-b2c2-fda2-5e15-e17437835a25.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewBackClipping Property

"Depth Clipping"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewBackClipping { get; }
```